app/controllers/api/bookclubs_controller.rb

SELECT "bookclubs".* FROM "bookclubs"
---
    def index
        bookclubs = Bookclub.all

INSERT INTO "bookclub_users" ("user_id", "bookclub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["bookclub_id", 15], ["created_at", "2021-11-24 19:56:40.136465"], ["updated_at", "2021-11-24 19:56:40.136465"]]
INSERT INTO "bookclubs" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Mystery Book Club"], ["created_at", "2021-11-24 19:56:40.129731"], ["updated_at", "2021-11-24 19:56:40.129731"]]
SELECT "bookclubs".* FROM "bookclubs" INNER JOIN "bookclub_users" ON "bookclubs"."id" = "bookclub_users"."bookclub_id" WHERE "bookclub_users"."user_id" = $1  [["user_id", 5]]
SELECT "books".* FROM "books" INNER JOIN "bookclub_books" ON "books"."id" = "bookclub_books"."book_id" WHERE "bookclub_books"."bookclub_id" = $1  [["bookclub_id", 16]]
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."user_id" = $1 AND "bookclub_users"."bookclub_id" = $2 LIMIT $3  [["user_id", 5], ["bookclub_id", 15], ["LIMIT", 1]]
UPDATE "bookclub_users" SET "updated_at" = $1, "isAdmin" = $2 WHERE "bookclub_users"."id" = $3  [["updated_at", "2021-11-24 19:56:40.154713"], ["isAdmin", true], ["id", 13]]
---
    def create
        user = @current_user
        bookclub = user.bookclubs.create(bookclub_params)
        bookclub_user = user.bookclub_users.find_by(bookclub_id: bookclub.id)
        bookclub_user.isAdmin = true
        bookclub_user.save

DELETE FROM "bookclubs" WHERE "bookclubs"."id" = $1  [["id", 18]]
---
    def destroy
        @bookclub.destroy

SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "bookclubs" SET "name" = $1, "updated_at" = $2 WHERE "bookclubs"."id" = $3  [["name", "Fandom"], ["updated_at", "2021-11-29 22:22:32.570773"], ["id", 16]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."bookclub_id" = $1 AND "bookclub_users"."user_id" = $2 LIMIT $3  [["bookclub_id", 16], ["user_id", 8], ["LIMIT", 1]]
UPDATE "bookclub_users" SET "updated_at" = $1, "isAdmin" = $2 WHERE "bookclub_users"."id" = $3  [["updated_at", "2021-11-26 22:13:13.054693"], ["isAdmin", true], ["id", 19]]
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."bookclub_id" = $1 AND "bookclub_users"."user_id" = $2 LIMIT $3  [["bookclub_id", 15], ["user_id", 8], ["LIMIT", 1]]
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."bookclub_id" = $1 AND "bookclub_users"."user_id" = $2 LIMIT $3  [["bookclub_id", 16], ["user_id", 9], ["LIMIT", 1]]
DELETE FROM "bookclub_users" WHERE "bookclub_users"."id" = $1  [["id", 25]]
INSERT INTO "bookclub_users" ("user_id", "bookclub_id", "created_at", "updated_at", "isAdmin") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 7], ["bookclub_id", 14], ["created_at", "2021-11-26 20:29:45.901515"], ["updated_at", "2021-11-26 20:29:45.901515"], ["isAdmin", false]]
---
    def update
        bookclub = Bookclub.find(params[:id])
        bookclub.update(bookclub_params)

        #check if admin is changed
        admin_bookclub_user = bookclub.bookclub_users.find {|user| user.isAdmin == true }
        admin_id = admin_bookclub_user.user_id

        if params[:admin_id] != admin_id
            admin_bookclub_user.update(isAdmin: false)
            new_admin_bookclub_user = bookclub.bookclub_users.find_by(user_id: params[:admin_id])
            new_admin_bookclub_user.update(isAdmin: true)
        end



        # delete users if needed
        if !params[:delete_users].empty?
            users = params[:delete_users].each do |user_id|
                bookclub_user = bookclub.bookclub_users.find_by(user_id: user_id)
                bookclub_user.destroy
            end
        end

        # add users if needed
        if !params[:add_users].empty?
            params[:add_users].each do |user_id|
                bookclub.bookclub_users.create(user_id: user_id, isAdmin: false)

SELECT "bookclub_books".* FROM "bookclub_books" WHERE "bookclub_books"."bookclub_id" = $1 AND "bookclub_books"."current" = $2 LIMIT $3  [["bookclub_id", 16], ["current", true], ["LIMIT", 1]]
SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "bookclub_books" SET "updated_at" = $1, "current" = $2 WHERE "bookclub_books"."id" = $3  [["updated_at", "2021-11-29 18:06:27.575939"], ["current", true], ["id", 10]]
UPDATE "bookclub_books" SET "status" = $1, "updated_at" = $2 WHERE "bookclub_books"."id" = $3  [["status", "In Progress"], ["updated_at", "2021-11-29 17:32:38.596913"], ["id", 8]]
---
    def current_book
        new_current_book = @bookclub.bookclub_books.find(params[:new_bookclub_book_id])
        old_current_book = @bookclub.bookclub_books.find_by(current: true)

        if old_current_book
            old_current_book.update(current: false, archived: true)
        end

        new_current_book.update(current: true)

SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def set_bookclub
        @bookclub = Bookclub.find(params[:id])