app/controllers/api/bookclub_books_controller.rb

SELECT "bookclub_books".* FROM "bookclub_books"
---
    def index
        render json: BookclubBook.all

DELETE FROM "bookclub_books" WHERE "bookclub_books"."id" = $1  [["id", 6]]
---
    def destroy
        @bookclub_book.destroy

SELECT "bookclub_books".* FROM "bookclub_books" WHERE "bookclub_books"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "bookclub_books" SET "status" = $1, "updated_at" = $2 WHERE "bookclub_books"."id" = $3  [["status", "In Progress"], ["updated_at", "2021-12-01 21:04:46.881902"], ["id", 11]]
---
    def update
        bookclub_book = BookclubBook.find(params[:id])
        bookclub_book.update(bookclub_book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "bookclub_books".* FROM "bookclub_books" WHERE "bookclub_books"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_bookclub_book
        @bookclub_book = BookclubBook.find(params[:id])