app/controllers/api/books_controller.rb

    def create
        book = Book.create(book_params)

        bookclub_book = book.bookclub_books.create(bookclub_book_params)
        bookclub_book.suggested_by = "#{@current_user.first_name} #{@current_user.last_name}"
        bookclub_book.save
---
INSERT INTO "books" ("imageURL", "title", "series", "description", "pages", "publicationDate", "genres", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "bookclub_books" ("bookclub_id", "book_id", "wishlist", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["bookclub_id", 17], ["book_id", 8], ["wishlist", true], ["status", "Not Started"], ["created_at", "2021-11-27 20:16:53.985382"], ["updated_at", "2021-11-27 20:16:53.985382"]]
SELECT "bookclub_books".* FROM "bookclub_books" WHERE "bookclub_books"."book_id" = $1  [["book_id", 8]]
SELECT "bookclubs".* FROM "bookclubs" INNER JOIN "bookclub_books" ON "bookclubs"."id" = "bookclub_books"."bookclub_id" WHERE "bookclub_books"."book_id" = $1  [["book_id", 8]]
INSERT INTO "bookclub_books" ("bookclub_id", "book_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bookclub_id", 16], ["book_id", 16], ["status", "Not Started"], ["created_at", "2021-11-28 23:39:45.259487"], ["updated_at", "2021-11-28 23:39:45.259487"]]
UPDATE "bookclub_books" SET "updated_at" = $1, "suggested_by" = $2 WHERE "bookclub_books"."id" = $3  [["updated_at", "2021-11-27 20:16:53.990685"], ["suggested_by", "#<User:0x00007fe1c56efc90>"], ["id", 2]]