app/controllers/api/bookclubs_controller.rb

    def update
        @bookclub.update(bookclub_params)

        #check if admin is changed
        admin = @bookclub.bookclub_users.find {|user| user.isAdmin == true }
---
SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]