app/controllers/api/comments_controller.rb

    def create
        comment = Comment.create(comment_params)
---
INSERT INTO "comments" ("user_id", "guide_question_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["guide_question_id", 2], ["comment", "hello"], ["created_at", "2021-12-02 22:09:42.889681"], ["updated_at", "2021-12-02 22:09:42.889681"]]