app/controllers/api/goals_controller.rb

    def create
        bookclub_book = BookclubBook.find(params[:bookclub_book_id])
        goal = bookclub_book.goals.create(goal_params)
---
SELECT "bookclub_books".* FROM "bookclub_books" WHERE "bookclub_books"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "goals" ("bookclub_book_id", "pages", "deadline", "complete", "created_at", "updated_at", "notes", "meetingURL") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
        goal = Goal.find(params[:id])
        goal.update(goal_params)
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "goals" SET "pages" = $1, "updated_at" = $2, "notes" = $3 WHERE "goals"."id" = $4  [["pages", "{1,51}"], ["updated_at", "2021-11-30 22:39:37.816064"], ["notes", "We will be reading Chapters 1 - 3 and going over discussion questions 1 - 5 hello"], ["id", 1]]

    def destroy
        @goal.destroy
---
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 4]]

    def set_goal
        @goal = Goal.find(params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]