app/controllers/api/guide_questions_controller.rb

    def create
        bookclub_book = BookclubBook.find(params[:bookclub_book_id])
        question = bookclub_book.guide_questions.create(question_params)
---
SELECT "bookclub_books".* FROM "bookclub_books" WHERE "bookclub_books"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "guide_questions" ("question", "chapter", "bookclub_book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        question = GuideQuestion.find(params[:id])
        question.update(question_params)
---
SELECT "guide_questions".* FROM "guide_questions" WHERE "guide_questions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "guide_questions" SET "chapter" = $1, "updated_at" = $2 WHERE "guide_questions"."id" = $3  [["chapter", 3], ["updated_at", "2021-12-02 18:39:08.000102"], ["id", 5]]

    def set_question
        @question = GuideQuestion.find(params[:id])
---
SELECT "guide_questions".* FROM "guide_questions" WHERE "guide_questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]