app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "first_name", "last_name", "location", "profile_color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        user = User.create(user_params)

UPDATE "users" SET "profile_color" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["profile_color", "#ffa726"], ["updated_at", "2021-11-26 23:03:36.089528"], ["id", 9]]
---
    def update
        user = @current_user
        user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 8]]
---
    def destroy
        @current_user.destroy