app/serializers/bookclub_serializer.rb

  def admin
    user_id = self.object.bookclub_users.find {|user| user.isAdmin == true }.user_id
    if user_id
      user = User.find_by(id: user_id)

      {
          id: user.id,
          email: user.email,
          first_name: user.first_name,
          last_name: user.last_name
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."bookclub_id" = $1  [["bookclub_id", 14]]
SELECT "bookclubs".* FROM "bookclubs" INNER JOIN "bookclub_users" ON "bookclubs"."id" = "bookclub_users"."bookclub_id" WHERE "bookclub_users"."user_id" = $1  [["user_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."bookclub_id" = $1  [["bookclub_id", 15]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]