app/serializers/bookclub_users_serializer.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def user
    user = User.find(self.object.user_id)

SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def bookclub
    bookclub = Bookclub.find(self.object.bookclub_id)