app/serializers/bookclub_user_serializer.rb

    def admin
        user_id = self.object.bookclub_users.find {|user| user.isAdmin == true }.user_id
        user = User.find_by(id: user_id)

        {
            id: user.id,
            email: user.email,
            first_name: user.first_name,
            last_name: user.last_name
---
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."bookclub_id" = $1  [["bookclub_id", 14]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "bookclub_users".* FROM "bookclub_users" WHERE "bookclub_users"."bookclub_id" = $1 LIMIT $2  [["bookclub_id", 14], ["LIMIT", 11]]