app/serializers/bookclub_book_serializer.rb

  def book
    book = Book.find(self.object.book_id)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def bookclub
    bookclub = Bookclub.find(self.object.bookclub_id)
---
SELECT "bookclubs".* FROM "bookclubs" WHERE "bookclubs"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]