app/serializers/comment_serializer.rb

  def username
    user = User.find(self.object.user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]